content/topics/digital_garden_themes.md
+++
title = "Digital Garden Themes"
author = ["hermes"]
draft = false
weight = 9999
+++

:ID:       284b3e6e-1f42-4ec6-b8dc-a3e71210d117
:ROAM_ALIASES: "Hugo Themes" "Wiki Themes" "Digital Garden Themes"


## Digital Garden Themes — Kandidaten für brainfck.org {#digital-garden-themes-kandidaten-für-brainfck-dot-org}

Stand: 2026-07-14 — Recherche für Relaunch von mit besserem Theme.


### Hugo Themes (Weiterhin bei Hugo bleiben) {#hugo-themes--weiterhin-bei-hugo-bleiben}


#### Hextra ⭐ 2.264 {#hextra-2-dot-264}

-   [GitHub](https://github.com/imfing/hextra)
-   [Demo](https://imfing.github.io/hextra/)
-   Modern, Tailwind, batteries-included, Docs/Wiki-optimiert
-   Volltextsuche, Sidebar, Mermaid, Dark Mode
-   Leichtgewichtig, kein JS-Build-Schritt
-   Bester Trade-off für Migration


#### Blowfish ⭐ 2.838 {#blowfish-2-dot-838}

-   [GitHub](https://github.com/nunocoracao/blowfish)
-   [Demo](https://blowfish.page/)
-   Tailwind CSS, sehr flexibel
-   Blog + Wiki Hybrid, Tags, Suche, Multi-Language
-   Große Community, viele Beispiel-Seiten


#### Hugo-Book ⭐ 4.068 {#hugo-book-4-dot-068}

-   [GitHub](https://github.com/alex-shpak/hugo-book)
-   [Demo](https://hugo-book-demo.netlify.app/)
-   Minimal, Buch-Layout, TOC, eingebaute Suche
-   Sehr einfach, wenig Overhead


#### Lotus Docs ⭐ 692 {#lotus-docs-692}

-   [GitHub](https://github.com/colinwilson/lotusdocs)
-   [Demo](https://lotusdocs.dev/)
-   Leichtgewichtig, modern, Tailwind
-   Docs-optimiert, Dark Mode


#### Geekdoc ⭐ 545 {#geekdoc-545}

-   [GitHub](https://github.com/thegeeklab/hugo-geekdoc)
-   [Demo](https://geekdocs.de/)
-   Clean, Docs-Fokus, Suche, Tags, Dark Mode


#### Docsy ⭐ 2.950 {#docsy-2-dot-950}

-   [GitHub](https://github.com/google/docsy)
-   [Demo](https://docsy.dev/)
-   Google-grade Documentation Theme
-   Mega flexibel, aber Heavy — Overkill für Wiki


#### Digital Garden (apvarun) ⭐ 296 {#digital-garden--apvarun--296}

-   [GitHub](https://github.com/apvarun/digital-garden-hugo-theme)
-   [Demo](https://digital-garden-hugo-theme.vercel.app/)
-   Multi-Column Layout, Pflanzen-Metapher
-   Einfach, schnell


#### Vitis ⭐ 250+ {#vitis-250-plus}

-   [GitHub](https://github.com/mohamedelhefni/vitis)
-   Keine öffentliche Demo gefunden
-   Obsidian-kompatibel: Wiki-Links, Knowledge Graph, Backlinks
-   Clean, minimal


#### Kavu (stultus) — neu {#kavu--stultus--neu}

-   [GitHub](https://github.com/stultus/kavu)
-   Monospace, terminal-inspiriert
-   Note Maturity Stages, Network Graph, Backlinks


#### HugoBlox Kit ⭐ 9.571 {#hugoblox-kit-9-dot-571}

-   [GitHub](https://github.com/HugoBlox/kit)
-   AI-gestützt: "Describe your site, AI builds it"
-   Tailwind Blocks, viele Layouts (Blog, Docs, Gallery, Landing)


### Vue-basiert {#vue-basiert}


#### VitePress ⭐ 14k+ {#vitepress-14k-plus}

-   [GitHub](https://github.com/vuejs/vitepress)
-   [Demo](https://vitepress.dev/)
-   Vite + Vue 3, ultra-schnell, SPA nach erstem Laden
-   Eigene Themes möglich, große Community


#### VuePress ⭐ 22k+ {#vuepress-22k-plus}

-   [GitHub](https://github.com/vuejs/vuepress)
-   [Demo](https://vuepress.vuejs.org/)
-   Vue 2, stabil, viele Plugins
-   Älter, aber bewährt


### Notes {#notes}

-   Switch zu Vue/Astro wäre mehr Aufwand (Org → Markdown Pipeline müsste neu)
-   Hextra oder Blowfish sind pragmatischste Upgrades innerhalb Hugo
-   Vitis wenn Obsidian-Integration gewünscht
-   Kein Deployment-Change nötig: Hugo + Netlify bleibt


## Related {#related}

-
